{
  "version": 1,
  "experiment name": "Merge Sort Implementation",
  "problems": [
    {
      "problem name": "Basic Merge Sort",
      "description": "Implement the basic Merge Sort algorithm to sort an array in ascending order. Recursively divide the array into halves until single elements remain, then merge the halves back together in sorted order by comparing elements from each half. Example: [2,5,1,15,22,19,100,81,70,149] should become [1,2,5,15,19,22,70,81,100,149]. Only JavaScript is allowed.",
      "inputs": [[2, 5, 1, 15, 22, 19, 100, 81, 70, 149]],
      "expected": [1, 2, 5, 15, 19, 22, 70, 81, 100, 149],
      "inputs description": "Input consists of an array of unsorted integers. It may be of arbitrary length.",
      "expected description": "An array of numbers e.g. [1, 2, 4, 5] sorted in ascending order",
      "difficulty": "beginner"
    },
    {
      "problem name": "Count Inversion Pairs using Merge Sort",
      "description": "Modify the Merge Sort algorithm to count inversions while sorting. An inversion occurs when arr[i] > arr[j] where i < j. During the merge step, count how many elements from the left subarray are greater than elements from the right subarray to achieve O(n log n) complexity. Example: [10,3,7,5,2,1] has 13 inversions and should return 13. Only JavaScript is allowed.",
      "inputs": [[10, 3, 7, 5, 2, 1]],
      "expected": 13,
      "inputs description": "The input is an array of integers representing the elements of the array. The array can be of any length.",
      "expected description": "An integer representing the number of inversion pairs in the array.",
      "difficulty": "intermediate"
    },
    {
      "problem name": "Merge Sort with Alternating Elements",
      "description": "Implement a modified Merge Sort to create an alternating pattern where elements are arranged as smallest, largest, second smallest, second largest, and so on. First sort the array using merge sort, then rearrange by alternately picking elements from the beginning and end of the sorted array. Example: [10,3,5,2,8,7,6,4,1,9] should become [1,10,2,9,3,8,4,7,5,6]. Only JavaScript is allowed.",
      "inputs": [[10, 3, 5, 2, 8, 7, 6, 4, 1, 9]],
      "expected": [1, 10, 2, 9, 3, 8, 4, 7, 5, 6],
      "inputs description": "The input is an array of integers. The array can be of any length.",
      "expected description": "An array sorted in alternating order: the smallest element first, the largest element second, the second smallest element third, the second largest element fourth, and so on.",
      "difficulty": "intermediate"
    }
  ]
}
